--Проект
--Реализация базы данных для склада
--Данная база данных нужна для хранении информации о товарах, их цене и количестве, которое хранится на данный момент и других характеристик
--1) Создадим саму таблицу
CREATE TABLE Goods(
    id INTEGER PRIMARY KEY,
    name_good VARCHAR(32000) NOT NULL,
    price INT NOT NULL,
    color VARCHAR(255) NOT NULL,
    size TEXT NOT NULL,
    article VARCHAR(13) UNIQUE NOT NULL,
    quantity INT NOT NULL,
    receipt_ofgood BOOLEAN DEFAULT(FALSE) NOT NULL
) --_____________________________________
--id - уникальный идентификатор товаров
--name_good - наименование товара
--price - цена товара
--color - цвет товара
--size - размер (одежды, к примеру, женская кофта размер которой S по российским меркам)
--quantity- количество товаров
--article - артикул товара
--receipt_ofgood - новое ли поступление товара (TRUE - да, FALSE - нет)
--2)Заполним ее данными
INSERT INTO Goods(
        id,
        name_good,
        price,
        color,
        size,
        article,
        quantity,
        receipt_ofgood
    )
VALUES(
        1,
        'Спортивный костюм мужской на флисе домашний с начесом теплый ',
        2628,
        'Tемно-синий',
        'M',
        '5234567890123',
        2343,
        TRUE
    ),
    (
        2,
        'Джинсы с высокой посадкой зауженные',
        2046,
        'Голубой',
        'XS',
        '4234567890124',
        327,
        FALSE
    ),
    (
        3,
        'Платье вечернее праздничное летнее офисное в горошек черное',
        1752,
        'Черный',
        'S',
        '0234567890126',
        433,
        FALSE
    ),
    (
        4,
        'Костюм спортивный женский тройка вечерний',
        4236,
        'Бежевый',
        'M',
        '7232564890126',
        943,
        FALSE
    ),
    (
        5,
        'Блузка офисная для девочки школьная',
        1060,
        'Белый',
        'XS',
        '2234567830126',
        41,
        TRUE
    ),
    (
        6,
        'Платье вечернее праздничное летнее офисное в горошек черное',
        1752,
        'Черный',
        'S',
        '5134567890126',
        433,
        FALSE
    ),
    (
        7,
        'Платье вечернее лапша женское',
        1700,
        'Черный',
        'S',
        '9234567894126',
        453,
        FALSE
    ),
    (
        8,
        'Спортивный костюм женский летний с брюками',
        2476,
        'Синий',
        'S',
        '3239580890126',
        33,
        TRUE
    ),
    (
        9,
        'Джинсы клеш голубые трубы широкие с высокой посадкой палаццо',
        2452,
        'Голубой',
        'S',
        '1234267890146',
        56,
        FALSE
    ),
    (
        10,
        'Платье вечернее праздничное летнее офисное в горошек черное',
        1752,
        'Черный',
        'S',
        '4234567890126',
        433,
        FALSE
    ),
    (
        11,
        'Брюки спортивные женские штаны джоггеры',
        1052,
        'Черный',
        'S',
        '9234567850126',
        53,
        FALSE
    ),
    (
        12,
        'Футболка оверсайз однотонная базовая',
        952,
        'Черный',
        'L',
        '5234567890126',
        53,
        FALSE
    ),
    (
        13,
        'Футболка оверсайз однотонная',
        852,
        'Белый',
        'XL',
        '8234567890126',
        93,
        FALSE
    ),
    (
        14,
        'Леггинсы спортивные',
        1452,
        'Черный',
        'S',
        '9234567890126',
        93,
        FALSE
    ),
    (
        15,
        'Худи',
        1252,
        'Голубой',
        'S',
        '3239567890106',
        93,
        FALSE
    ),
    (
        16,
        'Леггинсы в рубчик',
        752,
        'Бежевый',
        'L',
        '3294564890126',
        593,
        FALSE
    ),
    (
        17,
        'Футболка домашняя одежда',
        1652,
        'Белый',
        'M',
        '3234969890126',
        903,
        TRUE
    ),
    (
        18,
        'Косуха женская куртка кожаная оверсайз весна',
        4252,
        'Черный',
        'S',
        '3534567890126',
        53,
        TRUE
    ),
    (
        19,
        'Джинсы женские с высокой посадкой зауженные модные стильные',
        2282,
        'Голубой',
        'S',
        '3334567890126',
        99,
        FALSE
    ),
    (
        20,
        'Футболка оверсайз с принтом',
        9252,
        'Белый',
        'S',
        '3134567890126',
        253,
        FALSE
    ) --Запросы
    --1)Получить список всех товаров и их количество на складе
SELECT name_good,
    quantity
FROM goods;
--2)Получить список товаров, количество которых меньше 200
SELECT name_good,
    quantity
FROM goods
WHERE quantity < 200;
--3)Было поступление и количество футболок оверсайз с принтом (id =20) увеличилочь на 250, отобразить это в таблице можно следующим образом
UPDATE goods
SET quantity = quantity + 250
WHERE id = 20;
--4)На складе произошла ошибка, и товара с id = 7, не существует, поэтому его необходимо удалить из таблицы
DELETE FROM goods
WHERE id = 7;
--5)Вывести все товары, у которых новое поступление
SELECT *
FROM Goods
WHERE receipt_ofgood = TRUE;
--6)Вывести все товары, у которых размер S
SELECT *
FROM Goods
WHERE size = 'S';
--7)Вывести все товары, у которых цена больше 3000
SELECT *
FROM Goods
WHERE price > 3000;
--8)Вывести количество товаров с каждым размером
SELECT size,
    SUM(quantity)
FROM Goods
GROUP BY size;
--9)Удалить товары, у которых количество меньше 10
DELETE FROM Goods
WHERE quantity < 10;
--10)Обновить цену товара с артикулом '1234567890123' на 600
UPDATE Goods
SET price = 600
WHERE article = '1234567890123';
--11)Выбрать все товары, у которых цвет черный и размер S
SELECT *
FROM Goods
WHERE color = 'Черный'
    AND size = 'S';
--12) Выбрать все товары, у которых артикул начинается на '92'
SELECT *
FROM Goods
WHERE article LIKE '92%';
--13)Выбрать все товары, у которых цвет не равен белому
SELECT *
FROM Goods
WHERE color <> 'Белый';
--14)Выбрать все товары, у которых количество больше 800 и цена меньше 3000
SELECT *
FROM Goods
WHERE quantity > 800
    AND price < 3000;
--15)Выбрать все товары, у которых размер S или M
SELECT *
FROM Goods
WHERE size IN ('S', 'M');
--16)Выбрать все товары, у которых цена меньше или равна 1000
SELECT *
FROM Goods
WHERE price <= 1000;
--17)Выбрать все товары, у которых размер XS:
SELECT *
FROM Goods
WHERE size = 'XS';
--18)Выбрать все товары, которые есть в наличии и их количество больше 100:
SELECT *
FROM Goods
WHERE receipt_ofgood = TRUE
    AND quantity > 100;
--19)Выбрать все товары, которые есть в наличии
SELECT *
FROM Goods
WHERE receipt_ofgood = TRUE;
--20)Получить товар по самой высокой цене
SELECT *
FROM Goods
ORDER BY price DESC
LIMIT 1;
--21)Извлечь общее количество всех продуктов
SELECT SUM(quantity)
FROM Goods;
--22)Получить среднюю цену всех товаров
SELECT AVG(price)
FROM Goods;
--23)Удалить продукт с id = 2
DELETE FROM Goods
WHERE id = 2;
--24)Выбрать все товары, у которых цена между 1000 и 2000
SELECT *
FROM Goods
WHERE price BETWEEN 1000 AND 2000;
--25)Выбрать все товары, у которых количество меньше 100
SELECT *
FROM Goods
WHERE quantity < 100;
--26)Выбрать все товары, у которых цвет черный или белый
SELECT *
FROM Goods
WHERE color IN ('Черный', 'Белый');
--27)Выбрать все товары, у которых цвет начинается с буквы "Б"
SELECT *
FROM Goods
WHERE color LIKE 'Б%';
--28)Выбрать все товары, у которых цвет не равен черному или белому
SELECT *
FROM Goods
WHERE color NOT IN ('Черный', 'Белый');
--29)Получить среднюю цену товаров каждого цвета и размера
SELECT color,
    size,
    AVG(price)
FROM Goods
GROUP BY color,
    size;
--30)Получить количество товаров, цена которых больше средней цены всех товаров
SELECT COUNT(*) as count
FROM Goods
WHERE price > (
        SELECT AVG(price)
        FROM Goods
    );
--31)Получить список товаров, отсортированный по возрастанию цены
SELECT *
FROM Goods
ORDER BY price ASC;
--32)Получить список товаров, отсортированный по убыванию количества
SELECT *
FROM Goods
ORDER BY quantity DESC;
--33)Получить среднюю цену товаров каждого размера
SELECT size,
    AVG(price) as avg_price
FROM Goods
GROUP BY size;
--34)Получить количество товаров каждого цвета
SELECT color,
    COUNT(*) as count
FROM Goods
GROUP BY color;
--35)Получить список товаров, у которых количество меньше 50 и которые есть в наличии
SELECT *
FROM Goods
WHERE quantity < 50
    AND receipt_ofgood = TRUE;
--36)Получить товары, у которых цвет не белый и размер не XS
SELECT *
FROM Goods
WHERE color <> 'Белый'
    AND size <> 'XS';
--37)Получить товары, у которых название содержит слово "спортивный"
SELECT *
FROM Goods
WHERE name_good LIKE '%спортивный%';
--38)олучить количество товаров каждого размера, у которых цена больше 1000
SELECT size,
    COUNT(*) as count
FROM Goods
WHERE price > 1000
GROUP BY size;
--39)Получить среднюю цену товаров каждого цвета
SELECT color,
    AVG(price) as avg_price
FROM Goods
GROUP BY color;
--40)Получить количество товаров каждого цвета
SELECT color,
    COUNT(*) as count
FROM Goods
GROUP BY color;
